# Выполнил: Лабырин Матвей, ИВТ, 2 курс, 1 подгруппа
# Вариант: 3, 22

# Самостоятельная работа №3

# 1) (Для списка) Сумму элементов, расположенных на четных позициях, первой половины списка.

lst = [0, 1, 1, 2, 3, 5, 8, 13, 21, 34, 55, 89, 144, 233, 377, 610, 987, 1597, 2584, 4181, 6765, 10946]
print(sum(lst[0:11:2]))

# 2) (Для кортежа) Сумму всех целочисленных значений

car = ("name", " DeLorean DMC-12", "motor_pos", "rear", "n_of_wheels", 4, "n_of_passengers",
       2, "weight", 1.230, "height", 1.140, "length", 4.216, "width", 1.857, "max_speed", 177)
print(sum(car[5::2]))
